
/*
Напишите программу, которая на вход
принимает два целых числа и проверяет,
является ли первое число квадратом второго.
a = 25, b = 5 => да
a = 2, b = 10 => нет
a = 9, b = -3 => да
a = -3, b = 9 => нет
*/

// тип_данных имя_переменной = значение;
// // camelCase:  firstNumber, secondNumber - если переменная состоит из нескольких слов
// int number = 9; // number = 9
// int result = number * number; // 81

Console.Write("Введите число: ");
string input = Console.ReadLine();
Console.WriteLine(input + 1000);
